{"inkVersion":20,"root":[[{"->":"Day1"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Day1":["^Good morning, Agung.","\n","^You’ve been left in charge of the produce stall? You’ll do great. You spent so much time running around while your father ran it.","\n","^It’ll be such a help to the village to have you filling your father’s shoes. We must band together in times like this.","\n","^Those sweet potato slips you have will be ready to harvest the next day, but other plants may take two or three days to grow. Be sure to water them every day, or they will grow slower.","\n","^If you take good care of your crops, they will always yield vegetables or flowers. They will usually yield seeds or slips, too, but not every time.","\n","^Your tree there will help with keep the earth healthy for your crops.","\n","^Oh, will I be your first customer? Okay, time to see your haggling skills.  I’ll trade you 5 packets of seeds for you to sow for 4 chilis.","\n","end",{"GoodTrade":["^Remember, you don’t have to take every deal! In the end, it’s all up to you.","\n","^Anyway! Thank you for letting me pass on my farming knowledge.","\n","^I know your father has gone off with my boys to be a part of the war effort. We can help each other though. Support each other as best we can, hm?","\n","end",{"#f":1}],"BadTrade":["^Playing the tough game, I see.","\n","^You shouldn’t hold your advantage over people. Not in these times. Especially not elderly women who are only trying to help.","\n","^Ha--the look on your face! I'm only teasing you.","\n","^I’ll stop by again soon. And I’ll bring more seeds, if I can find any.","\n","end",{"#f":1}],"#f":1}],"Day2":["^So you’re the farmer I’ve been hearing so much about.","\n","^I am Mikel. A merchant, a traveler–there are many titles I could be given.","\n","^The reputation of both you and your father do not give your quaint shop justice.","\n","^However, I’m going to flip the roles now and give you the opportunity to peruse my wares.","\n","^Beginning of the season, yes? I have for you an international selection of seeds that would diversify your shelf with flavor and color!","\n","^Oh, the flowers are catching your eye, hmm?","\n","^Sunflowers will really brighten your garden. The seeds are edible but--ah, pardon me. Who am I to question the ideals of a young man who so clearly knows what he wants?","\n","^Now, these aren’t free, you know. What is it you have that is of worth? Hmmm?","\n","^Oh, sweet potatoes! They do go for a pretty price back home. Yes, that might do.","\n","^How about 3 sweet potatoes for 3 packets of sunflower seeds?","\n","end",{"GoodTrade":["^Fabulous! Here you are.","\n","^You are running a fantastic little stall here. I do hope all this horrid conflict doesn’t get in our way. We are both just trying to make a living, yes?","\n","^It was a pleasure doing business with you, young sir! Perhaps we shall meet again.","\n","end",{"#f":1}],"BadTrade":["^No? Shame.","\n","^Well, that’s us both losing out, isn’t it?","\n","^Your choice. I must be moving on now, sir. Good day to you and I wish you well.","\n","^I wish you better decision-making in the future when it comes to bargains.","\n","end",{"#f":1}],"#f":1}],"Day3":["^Hello, Agung! Have you been growing any flowers?","\n","^Do you want to know why I want some flowers, hmmmm?","\n","^If you insist. There was an event in town. I was just trying to cheer everyone up with this whole war business. And you know how the soldiers just rolled into town, well…","\n","^…And that’s how we ended up dancing. It was so romantic. So I wanted to take him some snacks and flowers.","\n","^Can I offer you some of my homemade batagor in exchange for some flowers?","\n","end",{"GoodTrade":["^You’re the best, Agung! I really hope he likes them! It’s going to be very embarrassing if he doesn’t…don’t know how I would recover…","\n","^Thank you for listening to all that. You know what I’m like, ever the romantic.","\n","^I think this one is different. I can feel this one is different. Everything just seems fated.","\n","^I’ll let you know how everything goes next time I come by!","\n","end",{"#f":1}],"BadTrade":["^What? Really?","\n","^Okay, I guess. I know it wasn’t the most equal trade.","\n","^But I thought you would’ve helped me pursue real love…","\n","^I’ll see you later.","\n","end",{"#f":1}],"#f":1}],"Day4":["^Excuse me--","\n","^Oh, you’re his son! Agung, isn’t it?","\n","^Yes, I can see it in you now.","\n","^I’m Satya, the officer who’s going to keeping an eye on our little village.","\n","^You’ve got a lovely stock here. Your father will be proud of how you’re running this place.","\n","^I heard all about him from the townsfolk. Sounds like such a caring man, helping everyone who needed it. I hope to meet him one day.","\n","^Oh, you have flowers! How about a bunch of flowers or a couple sweet potatoes for one gulden? Does that sound like a fair price?","\n","end",{"GoodTrade":["^Thank you!","\n","^I know this war is a horrible business.","\n","^I want the town to think of me as a friend, and remember I’m only following orders. I’m sure it’ll be over in a few weeks, before anything too awful needs to be enforced.","\n","^Thank you. See you later.","\n","end",{"#f":1}],"BadTrade":["^I understand. I know I'm not the friendliest face.","\n","^Remember I’m only following orders. I’m sure the war will be over in a few weeks, before anything too awful needs to be enforced.","\n","^See you later.","\n","end",{"#f":1}],"#f":1}],"Day5":["^Agung! It went perfect!","\n","^Sorry, I’ll stop shouting at you. I’m just excited.","\n","^He loved the basket. He said he was hoping I would come by. He’s so sweet and actually says how he feels rather than leaving me guessing.","\n","^The chase is fun, but it's nice to just know, you know.","\n","^We had the best talk but then his superior shouted at him for being late and began accusing me of distracting him.","\n","^I tried to explain to the man that I was dropping off presents for the boys who were at the dance hall the other night. He didn’t know that was where the boys had gone. I think I kinda threw them under the bus with that one.","\n","^They were meant to check that everyone there was safe, not join in drinking and dancing for hours… Whoops! So I’m not allowed back into the base.","\n","^But he gave me this bracelet as a promise that he’d come and visit me when he could.","\n","^A forbidden love. It’s poetic, don’t you think?","\n","^It’s so helpful talking to you, Agung.","\n","^I didn’t actually come here for anything! Just wanted to update you but erm… how about this bracelet for some sweet potatoes, hm?","\n","end",{"GoodTrade":["^Thanks!","\n","^You can keep it safe for me, so my mother doesn’t tell me off for trying to live out my romantic dreams.","\n","end",{"#f":1}],"BadTrade":["^Oh. Well, I didn't want to part with it, anyway…","\n","^I'll have to hide it somewhere to keep it safe from my mom. She'd tell me off if she knew I was getting presents from a boy!","\n","end",{"#f":1}],"#f":1}],"Day6":["^Hello again!","\n","^Young man, it’s nice to see you again. Seems like business is going well, hmmm?","\n","^It seems we are officially enemies now in more than just the trading game.","\n","^Well, there's no harm in us helping each other out.","\n","^I have these sugar cane seeds, very rare, precious even. Especially in this climate. May I offer them in exchange for some melati?","\n","^I have to bring home a gift after being away so long. My family is worried about travel at the moment. I told them I would be all right, but I might have under-estimated the severity of the situation.","\n","^These melati flowers look calming. We can all relax a little when I’m home.","\n","end",{"GoodTrade":["^Correct choice. I was presenting a deal very much in your favor there.","\n","^We don’t have to be enemies just because we have been told to be. Merchants, we are our own clan, going by our own codes.","\n","^It was nice seeing you again. Good luck and goodbye!","\n","end",{"#f":1}],"BadTrade":["^I said it, I suppose--we are now opponents of a sort.","\n","^I don’t want us to be enemies. We aren’t the ones fighting.","\n","^Goodbye, my young friend.","\n","end",{"#f":1}],"#f":1}],"Day7":["^Good morning, Agung. Have you received any letters from your father?","\n","^I’m so glad.  You don’t need to tell me what they said; I’m just happy to know you’re hearing from him.","\n","^My sons have been writing that they will be home soon; that all of this won’t last long, but in my experience, these things always overstay their welcome.","\n","^You don’t want to hear an old lady’s woes, though.","\n","^I actually brought you something. A prayer rug.","\n","^A long time ago, I used to make them. I wanted you to have one to pray for your father and my sons, and to connect us in these times.","\n","end",{"GoodTrade":["^Thank you, Agung. I’m sure my boys are right–they’ll be home safe and sound soon. And your father, too.","\n","end",{"#f":1}],"BadTrade":["^I'll just hang onto this for you, then.","\n","^I have a feeling that, in the next few years, we'll have even more need to pray.","\n","end",{"#f":1}],"#f":1}],"Day8":["^Hey, Agung.","\n","^This isn’t going to be nice, but I have to warn you, with rationing beginning, your farm’s produce is not yours to give out.","\n","^I know, I’m sorry.","\n","^I thought we’d never get to this point… I’m just here to give you a warning about it. Some of the other officers were talking about ‘confiscating’ from independent fams. While I’d like to hope they’d take it to be rationed, I’m not so sure.","\n","^You know I’m not going to take anything.","\n","^Out here we’re self-sufficient. In the cities, not so much. The rationing is to help those in urban spaces that are suffering the most from the bombings.","\n","^You understand.","\n","^It’s a team effort. As a country we have to pull together. I’m proud to help be a part of it.","\n","^Just take my warning now, okay? Close up shop. I don’t want anything to happen to you and your stall.","\n","end",{"GoodTrade":["^See you later, Agung.","\n","end",{"#f":1}],"BadTrade":["^See you later, Agung.","\n","end",{"#f":1}],"#f":1}],"Day9":["^Hello, Agung.","\n","^I need some, erm… some sugar cane or maybe sweet potatoes for a change, hm. I brought some extra seed packets to trade.","\n","^You’re still hearing from your father, yes? Regularly?","\n","^One of my sons has stopped sending me letters.","\n","^It’s been nearly two months since I heard from him.","\n","^I thought he might be making me worry for a laugh, like he used to when he was a boy. But he has more sense now.","\n","^I’ve asked the soldiers who have come to town to check for his name, but they just say he’s still listed as alive and in the barracks.","\n","^I know something has happened. A mother knows.","\n","^My eldest has been put in a different division from his brother. I haven’t told him. Don’t need to worry him as well.  But my youngest…","\n","^Well. About those sweet potatoes.","\n","end",{"GoodTrade":["^Thank you, Agung. Always such a sweet boy.","\n","^So much like your father. Both of you always such sweet boys.","\n","^Oh, and I know it’s late, but happy birthday!","\n","end",{"#f":1}],"BadTrade":["^Well, thank you just for listening, Agung. Always such a sweet boy.","\n","^So much like your father. Both of you always such sweet boys.","\n","^Oh, and I know it’s late, but happy birthday!","\n","end",{"#f":1}],"#f":1}],"Day10":["^Agung! The worst possible thing has happened.","\n","^My love has been sent to the front. I may never see him again.","\n","^How am I meant to live with him so far?","\n","^I haven’t heard from him since he left two weeks ago. What am I to do?","\n","^I haven’t left the house in days, barely eaten a thing…","\n","^Mother sent me to get something I will eat…","\n","^Do you have anything sweet? I think that’s what I want…","\n","^I brought a couple eggs from our chicken in exchange.","\n","end",{"GoodTrade":["^Thanks. I'm not sure I can eat, but I'll try. It does look tasty.","\n","end",{"#f":1}],"BadTrade":["^Well, I don't think I could have kept any food down anyway…","\n","^I'll see you around, Agung.","\n","end",{"#f":1}],"#f":1}],"Day11":["^Agung. It was Agung, wasn’t it?","\n","^Thank goodness. We meet again, sir. I’m here on business, of course.","\n","^May I confide in you?","\n","^I’m not allowed back. All travel over the border has been stopped. It is ridiculous, really. Who are they protecting the country from, its own citizens?","\n","^I’m sorry. Honestly, I’m starving but I have little to give now.","\n","^I will not take things for free, even from a fellow merchant. That is not the code, not the rules and certainly not a fair deal!","\n","^This is all I have left that is of worth… My wedding ring.","\n","end",{"GoodTrade":["^What?","\n","^No, I can’t.","\n","^It isn’t proper of a merchant…","\n","^Thank you, Agung.","\n","^I’m worried and desperate. How the mighty have fallen, huh?","\n","^I appreciate your kindness more than I can express.","\n","end",{"#f":1}],"BadTrade":["^Thank you. I'll miss that ring, but we do what we must…","\n","^Good luck, young man.","\n","end",{"#f":1}],"#f":1}],"Day12":["^I warned you.","\n","^Agung, I don’t want to do this. Why didn’t you listen to me?","\n","^The rationing. Do you not get it? There’s more than just our little village struggling. Not everyone has a garden or farm  on their doorstep.","\n","^I’ve been instructed to take all the vegetables you have. I'm sorry.","\n","^I’m not going to take everything. I’ll leave you enough to get by.","\n","end",{"GoodTrade":["^I know. I’m sorry, lad.","\n","^Who knows, maybe some of this will end up feeding your father.","\n","^That’s a nice thought, right?","\n","end",{"#f":1}],"BadTrade":["^I know. I’m sorry, lad.","\n","^Who knows, maybe some of this will end up feeding your father.","\n","^That’s a nice thought, right?","\n","end",{"#f":1}],"#f":1}],"Day13":["^I got a letter!","\n","^Agung! Did you hear me? He sent me a LETTER!","\n","^I was starting to think he’d forgotten about me, but no, he remembered! He had a couple weeks of training and they weren’t allowed to write or receive letters; he just had to focus!","\n","^He wrote all about how he missed me, how he is going to be fighting for me, to be able to come home to me. HOW SWEET!","\n","^I was prepared for him to go away and that would be the end.","\n","^I’d barely be a memory for him, just some village girl who fawned all over him.","\n","^But I think he does like me, and misses me.","\n","^It feels different from my other crushes. I’m not in over my head, I just actually feel wanted.","\n","^Where did you get that pretty medal?","\n","^From your dad? Then he’s a hero!","\n","^Maybe my love will earn one of his own someday.","\n","^The only thing he’s given me is that bracelet, but it’s as precious to me as any medal!","\n","end",{"GoodTrade":["^You kept this?","\n","^Wow… thank you, Agung.","\n","^Mother would’ve definitely thrown it away if she knew it was from a boy.","\n","^I think I'll keep it now, wear it. To reassure me that he is coming home.","\n","^See what I said about fate! He has to come back. No romance ends in the middle!","\n","^I’ll see you later, Agung!","\n","end",{"#f":1}],"BadTrade":["^I'll see you later, Agung. To let you know when I hear from him again.","\n","^See what I said about fate! He has to come back. No romance ends in the middle.","\n","end",{"#f":1}],"#f":1}],"Day14":["^Agung. A mother knows. A mother always knows.","\n","^Maybe something would’ve been done if those blasted soldiers had listened to me. They just needed to check in with his officer that he was there and safe.","\n","^My youngest--he’s been reported as missing in action.","\n","^What does that even mean?","\n","^I’m sorry, Agung. I needed to tell someone. The house is so quiet, despite the noise of the world around us.","\n","^I know you don’t have the answers. I’m not expecting you to.","\n","^Hopefully he’s just taken a wrong turn and ended up with the wrong group.","\n","^I’m going to tell his brother now. My eldest is an officer. Said it should keep him safe. I don’t want to know how exaggerated the ‘safe’ is.","\n","^At least one son will come home at the end of this.","\n","^Sorry, Agung. I know you don’t mind, but I do. An old woman like me crying in front of you.","\n","end",{"GoodTrade":["^Oh, Agung. It’s beautiful.","\n","^You’re doing such a good job here. I wish your father could come home to see you.","\n","end",{"#f":1}],"BadTrade":["^Thank you for listening. Sometimes that’s all I need.","\n","^You’re doing such a good job here. I wish your father could come home to see you.","\n","end",{"#f":1}],"#f":1}],"Day15":["^Agung…","\n","^My eldest has been promoted to a first lieutenant. I'm happy. I don’t sound it, but I am.","\n","^I’m proud of him. He’s worked hard for it. He’s been able to send me extra medical supplies. I don’t know if he’s allowed to, but I’m not going to turn them down.","\n","^I need to be here to see my boys come home to me. Both of them.","\n","^My youngest… is still missing in action. They think he’s been taken prisoner.","\n","^At least he might be somewhere.  It’s better than knowing nothing.","\n","^Please take this medical kit. Not to trade. For yourself. For keeping me company through all of this.","\n","end",{"GoodTrade":["^I hope that will help. It's been good talking to you.","\n","^I can’t get out as much as I used to, but there are fewer and fewer people to visit anyway.","\n","^The village is half the size of what it was. How much longer can they do this to us?","\n","end",{"#f":1}],"BadTrade":["^It's your choice. But I'm not sure when I'll next be able to come by.","\n","^I can’t get out as much as I used to, but there are fewer and fewer people to visit anyway.","\n","^The village is half the size of what it was. How much longer can they do this to us?","\n","end",{"#f":1}],"#f":1}],"Day16":["^Agung, hello there. I know it’s been a while.","\n","^I’m sorry about my last visit. I have the same orders this time, But I’m not going to follow them, so take this as another warning.","\n","^I know the village is struggling. There doesn’t seem to be enough food to go around.","\n","^I don’t understand where it’s all going. There are crates and crates of it being shipped out. Hopefully it's going to whoever needs it most.","\n","^We’re under a lot of pressure at the office to keep everyone to their rationing amounts.","\n","^Still growing flowers?","\n","^Something has to be just for happiness, I suppose.","\n","^I’ll buy a couple. Don’t tell anyone.","\n","^I just want something to bring light into my home, something for my family. I can’t offer much else to them now.","\n","end",{"GoodTrade":["^Thank you. It’s the little things.","\n","^I really am sorry about last time I came by.","\n","^I was brash and scared of the repercussions of disobeying orders. There’s not as much to fear now. They don’t have any officers to spare.","\n","end",{"#f":1}],"BadTrade":["^Fair enough, lad. Fair enough. I don’t blame you after how I treated you last time.","\n","^Be careful, please. People will do anything when they are desperate enough.","\n","end",{"#f":1}],"#f":1}],"Day17":["^Agung! Can you see anyone behind me?","\n","^Are you sure? I think someone has been following me…I know how it sounds.","\n","^Yesterday, I tried to get home again. Not even to my family, just into the country.","\n","^None of them believed me. They threw away my passport. They didn’t believe I was a resident!","\n","^Since then I feel like someone’s been following me… Call me paranoid, call me insane, but the feeling of eyes on the back of my neck is too distinct. Too uncomfortable.","\n","^That is the unmistakable feeling of being prey to a hungry predator. They’re doing it to frighten me… playing with their food.","\n","^I know I’m rambling on but I’m scared…","\n","^I just want to go home… For this horror to end and life to settle down.","\n","^They forget it affects us, the little people trapped in the middle of it all.","\n","^I’m sorry, we all have our woes with this war. You look like one who has worries of his own.","\n","^I just want to read my daughter one more story…","\n","end",{"GoodTrade":["^Thank you. If I could offer something and think you’d accept it from such a desperate old man, well, you know I would.","\n","^Your kindness really shines through all else. I can tell in your eyes: You know the pain I speak of.","\n","^The fear for the future. For things outside of our control. Little cogs in a big machine.","\n","^You've grown so much since our first meeting all that time ago. Maturity looks good on you.","\n","end",{"#f":1}],"BadTrade":["^We've all gotten a little harder over the years, a little tougher, haven't we? That's what war does to you.","\n","^You've grown so much since our first meeting all that time ago. Maturity looks good on you.","\n","end",{"#f":1}],"#f":1}],"Day18":["^Hey Agung. I finally heard from him.","\n","^I know why it took so long… He got injured. Badly. Shot in the leg.","\n","^He’s alive, but he lost a lot of blood, so they’re worried.","\n","^He told me how scared he is. He wants to make it and…","\n","^…he wants to come home to me!","\n","^I shouldn’t sound excited, but if he’s hurt they can’t have him fight anymore, right? I could care for him.","\n","^Oh, I came for some flowers. Our neighbor’s brother was killed. He was on the front and--well, mum wants to take flowers round.","\n","end",{"GoodTrade":["^Hm? I’m sorry if I seem off… it’s not with you. Or anyone, really.","\n","^It’s with the world and things none of us can control. Prayer seems pointless, because why would any almighty being not do something to calm the madness? To allow people some moments of bliss and peace.","\n","^Indah and my mother were talking about the last war the other day. Mother doesn’t remember a lot of it. She was only a child but she knows the effects.","\n","^Such a short break from the chaos…","\n","^There isn’t much else to do but hope and pray. Someone is listening somewhere.","\n","^I just want my future to come home. That’s what I see in his letters. That’s what I see in our relationship.","\n","^If we can survive these years of war, we can survive anything.","\n","^Thank you for always listening to me, Agung.","\n","^I’m never sure if we’re friends but I certainly consider you to be one.","\n","end",{"#f":1}],"BadTrade":["^Hm? I’m sorry if I seem off… it’s not with you. Or anyone, really.","\n","^It’s with the world and things none of us can control. Prayer seems pointless, because why would any almighty being not do something to calm the madness? To allow people some moments of bliss and peace.","\n","^Indah and my mother were talking about the last war the other day. Mother doesn’t remember a lot of it. She was only a child but she knows the effects.","\n","^Such a short break from the chaos…","\n","^There isn’t much else to do but hope and pray. Someone is listening somewhere.","\n","^I just want my future to come home. That’s what I see in his letters. That’s what I see in our relationship.","\n","^If we can survive these years of war, we can survive anything.","\n","^Thank you for always listening to me, Agung.","\n","^I’m never sure if we’re friends but I certainly consider you to be one.","\n","end",{"#f":1}],"#f":1}],"Day19":["^Do you have any more sugar cane?","\n","^I'll understand if you don't. Supplies are short everywhere.","\n","end",{"GoodTrade":["^They found him.","\n","^At a prisoner of war camp.","\n","^He’s alive, at least. The other soldiers in town said…said that he’ll be kept alive as a bargaining chip.","\n","^They really are just pawns in this game.","\n","^Hopefully he’ll remain useful to them so they keep him alive. And then he can come home.","\n","^However much of him is left after the war. However much of any of them is left when they return.","\n","^How is your father?","\n","^You haven’t heard from him today?","\n","^Maybe the mail has just been delayed again. It’s always getting held up with the supply lines the way they are.","\n","^I know that’s not much consolation.","\n","^War hurts the soul more than it can a body.","\n","end",{"#f":1}],"BadTrade":["^They found him.","\n","^At a prisoner of war camp.","\n","^He’s alive, at least. The other soldiers in town said…said that he’ll be kept alive as a bargaining chip.","\n","^They really are just pawns in this game.","\n","^Hopefully he’ll remain useful to them so they keep him alive. And then he can come home.","\n","^However much of him is left after the war. However much of any of them is left when they return.","\n","^How is your father?","\n","^You haven’t heard from him today?","\n","^Maybe the mail has just been delayed again. It’s always getting held up with the supply lines the way they are.","\n","^I know that’s not much consolation.","\n","^War hurts the soul more than it can a body.","\n","end",{"#f":1}],"#f":1}],"Day20":["^Do you have anything? I can’t offer much, but please. Any food you have.","\n","^Rationing isn’t working. The richer city folk are paying off the officers for extra food to stockpile. That isn’t how it’s meant to work.","\n","^You have crops though? Food?","\n","^My family isn’t well. I was keeping to the rations they said we were entitled to--The army doctor said my children were malnourished.","\n","^I can’t say I’m surprised; we were given so little. If everyone’s getting little then I’m happy to be getting something, but…","\n","^The system works in nasty ways.","\n","^I just wanted to contribute without being on the front lines. Maybe that would’ve been better.","\n","^I’m sorry for how I treated you. You were doing what you could.","\n","^I have fabric. My wife wove together some blankets, but they could be clothing or to something to tuck yourself into bed with. The nights are so cold at the moment.","\n","end",{"GoodTrade":["^Thank you. I can’t turn this down, even though it feels too much.","\n","^Agung, your father will be so proud of you when you tell him how you’ve helped. He got it all right in raising you.","\n","^Young, intelligent and compassionate. I hope my children get the chance to be the same.","\n","^I just want them to have the chance.","\n","end",{"#f":1}],"BadTrade":["^I understand. I treated you unfairly.","\n","^It’s okay. Really. We'll be okay.","\n","^Thank you for listening to a desperate man’s cries.","\n","end",{"#f":1}],"#f":1}],"Day21":["^Will you look at that? Acorns!","\n","^How can the day you planted that tree feel like yesterday and a thousand years ago at the same time?","\n","^How that little tree has grown. Much like yourself.","\n","^I have something too. I found a bird’s nest full of eggs.","\n","^Strange, isn't it, how they can keep on in the midst of all this?","\n","^I just got the news.","\n","^My younger son…","\n","^They were trying to recapture the POW camp and he--he’s gone.","\n","^But my eldest son has been given leave. He's coming home.","\n","^Please don't lose hope, Agung.","\n","^None of us know what tomorrow will bring. Like the birds, we have to keep on.","\n","end",{"GoodTrade":["^I know. You were hoping that when this day came, when the tree was full grown, he’d be here with you to see it.","\n","^Believe me, I understand.","\n","^But wherever he is…I know he's proud of you.","\n","end",{"#f":1}],"BadTrade":["^I know. You were hoping that when this day came, when the tree was full grown, he’d be here with you to see it.","\n","^Believe me, I understand.","\n","^But wherever he is…I know he's proud of you.","\n","end",{"#f":1}],"#f":1}],"#f":1}],"listDefs":{}}